13_process_mining/README.org
#+TITLE:Process mining
#+AUTHOR:Marcus Birkenkrahe
#+SUBTITLE: Data modeling seminar 482.02 Fall 2021
#+STARTUP: overview
#+OPTIONS: toc:1 num:nil ^:nil
#+INFOJS_OPT: :view:info
* What will you learn?

  * What is process mining?
  * How is it done in practice?

* What is process mining?

  * [[https://youtu.be/-u5y2dST7ng]["What is process mining?"]] 7 minutes ([[sif][Sifters, 2017]]).

** Summary

   1) Compare process models (ideal) with process reality
   2) Issues: design disconnect, exceptions, "game trails"
   3) Nobody has a complete picture of the whole process chain
   4) IT processes are usually intangible
   5) Key = event logs (big data) - ([[https://media.hwr-berlin.de/video/Signavio-PI-2-from-event-log-to-process-discovery/150853d4b70cc7a8144c4ab48e9f6b0f][video]])
   6) Algorithms mine the data automatically
   7) Process mining = objective, complete, and fast

** There is more

   * Interpretation of process mining maps non-trivial
   * Domain knowledge is important
   * Event logs need to be validated

* How is it done in practice?

  * Signavio Process Intelligence demo ([[sig][Signavio, 2021]])
  * Celonis example ([[cel][Celonis, 2021]]).

** Signavio Process Intelligence

   * "Data stories" are not automatically unlocked
   * Tried and tested with (graduate) students
   * Integration with BPMN process manager useful
   * SQL integration visible (query language)
   * Do it yourself in editor.signavio.com ([[https://github.com/birkenkrahe/mod482/tree/main/13_process_mining/data][data here]])

     [[https://media.hwr-berlin.de/search/title/signavio+pi/description/signavio+pi/tags/signavio+pi/type/all/search/basic/categoriesopt/0][Video playlist]]

** Celonis Execution Management System

   * Dashboard not intuitive (overloaded)
   * Excellent demo videos (esp. finance)
   * Free 1 hour process mining practice kickstarter course

* References

  <<cel>> Celonis (Feb 14, 2021). What is Process Mining? [video] [[https://youtu.be/hsdHZ5MJBNM][URL:
  youtu.be/hsdHZ5MJBNM]]

  <<sif>> Sifters Process Performance (Aug 21, 2017). What is Process
  Mining? | Sifters [video]. [[https://youtu.be/-u5y2dST7ng][URL: youtu.be/-u5y2dST7ng]]

  <<sig>> SAP Signavio Process Intelligence (2021). [Website] [[https://www.signavio.com/products/process-intelligence/][URL:
  signavio.com/products/process-intelligence/]]
