13_process_mining/README.md

# Table of Contents

-   [What will you learn?](#orga8f8ba7)
-   [What is process mining?](#orgcaefc27)
    -   [Summary](#orgf661704)
    -   [There is more](#org2911da1)
-   [How is it done in practice?](#org5a38529)
    -   [Signavio Process Intelligence](#orgb645d46)
    -   [Celonis Execution Management System](#orge1f7801)
-   [References](#org0f050f4)



<a id="orga8f8ba7"></a>

# What will you learn?

-   What is process mining?
-   How is it done in practice?


<a id="orgcaefc27"></a>

# What is process mining?

-   ["What is process mining?"](https://youtu.be/-u5y2dST7ng) 7 minutes ([Sifters, 2017](#org98667ea)).


<a id="orgf661704"></a>

## Summary

1.  Compare process models (ideal) with process reality
2.  Issues: design disconnect, exceptions, "game trails"
3.  Nobody has a complete picture of the whole process chain
4.  IT processes are usually intangible
5.  Key = event logs (big data) - ([video](https://media.hwr-berlin.de/video/Signavio-PI-2-from-event-log-to-process-discovery/150853d4b70cc7a8144c4ab48e9f6b0f))
6.  Algorithms mine the data automatically
7.  Process mining = objective, complete, and fast


<a id="org2911da1"></a>

## There is more

-   Interpretation of process mining maps non-trivial
-   Domain knowledge is important
-   Event logs need to be validated


<a id="org5a38529"></a>

# How is it done in practice?

-   Signavio Process Intelligence demo ([Signavio, 2021](#org8b02f84))
-   Celonis example ([Celonis, 2021](#org1f8e553)).


<a id="orgb645d46"></a>

## Signavio Process Intelligence

-   "Data stories" are not automatically unlocked
-   Tried and tested with (graduate) students
-   Integration with BPMN process manager useful
-   SQL integration visible (query language)
-   Do it yourself in editor.signavio.com ([data here](https://github.com/birkenkrahe/mod482/tree/main/13_process_mining/data))
    
    [Video playlist](https://media.hwr-berlin.de/search/title/signavio+pi/description/signavio+pi/tags/signavio+pi/type/all/search/basic/categoriesopt/0)


<a id="orge1f7801"></a>

## Celonis Execution Management System

-   Dashboard not intuitive (overloaded)
-   Excellent demo videos (esp. finance)
-   Free 1 hour process mining practice kickstarter course


<a id="org0f050f4"></a>

# References

<a id="org1f8e553"></a> Celonis (Feb 14, 2021). What is Process Mining? [video] [URL:
youtu.be/hsdHZ5MJBNM](https://youtu.be/hsdHZ5MJBNM)

<a id="org98667ea"></a> Sifters Process Performance (Aug 21, 2017). What is Process
Mining? | Sifters [video]. [URL: youtu.be/-u5y2dST7ng](https://youtu.be/-u5y2dST7ng)

<a id="org8b02f84"></a> SAP Signavio Process Intelligence (2021). [Website] [URL:
signavio.com/products/process-intelligence/](https://www.signavio.com/products/process-intelligence/)

